#+LATEX_HEADER: \usepackage{amsmath}
#+STARTUP: showeverything
#+STARTUP: latexpreview

$$1+1=2$$
$$1+1=2$$
$2 \cdot 2 = 4$
$\alpha$
$$\beta$$
$\gamma$

* Check python version
#+BEGIN_SRC python
import sys
return sys.version
#+END_SRC

#+RESULTS:
: 3.5.2 (default, Sep 18 2016, 03:17:32) 
: [GCC 5.4.0 20160609]

* Definition
#+BEGIN_SRC python
complex = 2 + 3j
output = complex.imag
#output = dir(1j)
return output
#+END_SRC

#+RESULTS:
: 3.0

* Addition
Complex numbers are [[added]] by separately adding the real and imaginary parts of the summands.
$$(a + bi) + (c + di) = (a + c) + (b + d)i$$

#+BEGIN_SRC python
complex1 = 5 + 4j
complex2 = 3 + 2j
output = (complex1) + (complex2)
return output
#+END_SRC

#+RESULTS:
| 8+6j |

#+BEGIN_SRC python
complex1 = 5 + 3j
complex2 = -2 -1j
output = (complex1) + (complex2)
return output
#+END_SRC

#+RESULTS:
| 3+2j |

* Subtraction
Similarly as [[Addition]].
$$(a + bi) - (c + di) = (a - c) + (b - d)i$$

#+BEGIN_SRC python
complex1 = 5 + 4j
complex2 = 3 + 2j
output = (complex1) - (complex2)
return output
#+END_SRC

#+RESULTS:
| 2+2j |

* Multiplication and division
The multiplication of two complex numbers is defined by the following formula:
$$(a + bi)(c + di) = (ac - bd) + (bc + ad)i$$

#+BEGIN_SRC python
complex1 = 5 + 4j
complex2 = 3 + 2j
output = (complex1) * (complex2)
return 'complex1 = {}\ncomplex2 = {}\nanswer = {}'.format(complex1, complex2, output)
#+END_SRC

#+RESULTS:
: complex1 = (5+4j)
: complex2 = (3+2j)
: answer = (7+22j)

* Addition and multiplication

#+BEGIN_SRC python
complex1 = 3 + 4j
complex2 = 5 - 3j
complex3 = 1 + 2j
output = 2 * (complex1) + (complex2) * (complex3)
output2 = 2 * (complex1)
output = (complex2) * (complex3) 
output = (output2) + (output)
return 'complex1 = {}\ncomplex2 = {}\ncomplex3 = {}\nanswer = {}'.format(complex1, complex2, complex3, output)
#+END_SRC

#+RESULTS:
: complex1 = (3+4j)
: complex2 = (5-3j)
: complex3 = (1+2j)
: answer = (17+15j)

#+BEGIN_SRC python
from sympy import solve
from sympy.abc import x, y

#output = solve([x + 5*y - 2, -3*x + 6*y - 15], [x, y])
output = solve([(1 + 2j)*x + (3 - 5j)*y, 1 - 3j], [x, y])

return output
#+END_SRC

#+RESULTS:
: []

